## Pandas Read CSV File in Python
    Pandas, a CSV (Comma Separated Values) file is read using the function pd.read_csv().
    This function loads the CSV data into a DataFrame, which allows easy analysis and manipulation.

In [7]:
import pandas as pd

### Read CSV file by pandas

In [28]:
df = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\VC_Startups_1.csv")
df.head(2)

         Date  R & D Spend  Marketing Spend  Profit
0  01-07-2019       165346           136897  192261
1  02-07-2019       164590           151377  191792

In [34]:
df1 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv")
df1.head(2)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0

### Change the index column by [ index_col ]

In [41]:
df1 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",index_col="Date")  
df1.head(2)

            Student ID  Class Section  Study hrs  Percentage
Date
01-07-2019      1001.0     10       A        2.0        50.0
02-07-2019      1002.0     10     NaN        NaN        80.0

### Skip the rows, starts from the features

In [52]:
df1 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",skiprows=2)  
df1.head(2)

   02-07-2019  1002.0  10 Unnamed: 3  Unnamed: 4  80.0
0  03-07-2019     NaN  10        NaN         3.0  60.0
1  06-07-2019     NaN  11        NaN         0.0   NaN

### For Accessing the particular column in file

In [54]:
df2 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",usecols=[0,1,2])
df2.head(2)

         Date  Student ID  Class
0  01-07-2019      1001.0     10
1  02-07-2019      1002.0     10

### Accessing particular rows

In [56]:
df3 = pd.read_csv("C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv",nrows=3)
df3.head(2)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0

In [64]:
# For checking the column 
df3.columns

Index(['Date', 'Student ID', 'Class', 'Section', 'Study hrs', 'Percentage'], dtype='object')

### Gives the data type of every column

In [66]:
df3.dtypes

Date           object
Student ID    float64
Class           int64
Section        object
Study hrs     float64
Percentage    float64
dtype: object

In [68]:
df3.head(2)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0

In [70]:
df3.tail(1)

         Date  Student ID  Class Section  Study hrs  Percentage
2  03-07-2019         NaN     10     NaN        3.0        60.0

### Entire Information of Dataset

In [72]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date        3 non-null      object
 1   Student ID  2 non-null      float64
 2   Class       3 non-null      int64
 3   Section     1 non-null      object
 4   Study hrs   2 non-null      float64
 5   Percentage  3 non-null      float64
dtypes: float64(3), int64(1), object(2)
memory usage: 276.0+ bytes

### Changing Features name

In [60]:
pd.read_csv('C:\\Users\\Dell\\Desktop\\_PANDAS_\\Data\\Fortune_10_day13.csv', names = ['1','2','3','4','5','6','7'] ).head(3)

            1           2      3        4          5           6   7
0        Date  Student ID  Class  Section  Study hrs  Percentage NaN
1  01-07-2019      1001.0     10        A        2.0        50.0 NaN
2  02-07-2019      1002.0     10      NaN        NaN        80.0 NaN